In [2]:
import boto3
import pandas as pd
import numpy as np
import psycopg2
import configparser
import pymysql

# conectarse

In [5]:
config = configparser.ConfigParser()
config.read('config.cfg')
aws_rds_conn = boto3.client('rds', aws_access_key_id=config.get('IAM','ACCES_KEY'),
                            aws_secret_access_key=config.get('IAM','SECRETE_ACCES_KEY'),
                            region_name='us-east-1')

# verificar instancias

In [6]:
rds_instances_ids =[]
aws_response= aws_rds_conn.describe_db_instances()

for response in aws_response ['DBInstances']:
    rds_instances_ids.append(response['DBInstanceIdentifier'])
print(f" Instancias Disponilbes:{rds_instances_ids}")

 Instancias Disponilbes:['dw-transactional', 'venta-transactional']

# Hostname

In [7]:
try:
    instance = aws_rds_conn.describe_db_instances(DBInstanceIdentifier=config.get('TRANSACC', 'DB_INSTANCE_ID'))
    RDS_HOSTNAME = instance.get('DBInstances')[0].get('Endpoint').get('Address')
    print(RDS_HOSTNAME)
except Exception as ex:
    print("Error!!!", ex)

dw-transactional.c1i8ws84e2em.us-east-1.rds.amazonaws.com

# Lectura de tablas

In [8]:
driver = f"""mysql+pymysql://{config.get('TRANSACC', 'DB_USER')}:{config.get('TRANSACC', 'DB_PASSWORD')}@{RDS_HOSTNAME}:{config.get('TRANSACC', 'DB_PORT')}/{config.get('TRANSACC', 'DB_NAME')}"""
driver

'mysql+pymysql://mysql_admin:W8GB7F4Tks63-gjl@dw-transactional.c1i8ws84e2em.us-east-1.rds.amazonaws.com:3306/modelodw'

In [11]:
dim_articulo = pd.read_sql('SELECT * FROM dim_articulo;', driver)
dim_articulo.head()

,articulo_id,codigo,nombre,precio_venta,stock,descripcion,imagen
0,1,EJML6D1A82,Económico Pan Integral,95.82,110,El complemento perfecto para cualquier comida.,img00001.jpg
1,2,RBIRFY8PF2,Calidad Pan Integral,83.72,51,El favorito de todos a un precio accesible.,img00002.jpg
2,3,B0URP6ECZ7,Fresco Chocolate,87.91,107,Disfruta de la mejor calidad en cada bocado.,img00003.jpg
3,4,I2J0WQTJJZ,Importado Chocolate,76.70,6,Cultivado localmente con prácticas sostenibles.,img00004.jpg
4,5,QWI4BZ23VX,Delicioso Vino,5.52,198,Empacado con nutrientes y sabor.,img00005.jpg

In [12]:
dim_cliente = pd.read_sql('SELECT * FROM dim_cliente;', driver)
dim_cliente.head()

,cliente_id,tipo_persona,nombre,tipo_documento,num_documento,direccion,telefono,email
0,1,Natural,Sarah Little,DNI,5094558868,6653 Williams Ridges Apt. 363 East Stephanieto...,+502 6208 7689,griffinjared@garcia.com
1,2,Jurídica,Riley Sawyer,RUC,6294099776,"19116 Hale Parks Lake Carl, VA 72820",+502 6160 9808,aliciadudley@lopez.org
2,3,Jurídica,Kimberly Hamilton,DNI,754055998,"0747 Evans Shoals Suite 029 East Joseph, WI 73168",+502 6733 6206,phillipskathryn@hotmail.com
3,4,Natural,Leon Hernandez,DNI,8797802153,"19049 Katherine Passage North Johnside, CO 95119",+502 6880 2601,shortmichael@gmail.com
4,5,Natural,Jose Sullivan,RUC,1691304141,"2730 Vincent River Apt. 900 South Louistown, I...",+502 6216 2838,blake67@hotmail.com

In [13]:
dim_usuario = pd.read_sql('SELECT * FROM dim_usuario;', driver)
dim_usuario.head()

,usuario_id,nombre,tipo_documento,num_documento,direccion,telefono,email,rol_id
0,1,Steven Myers,PAS,88604995,"51327 Ramirez IslandsHollowayport, KS 87700",+502 5082 6571,pricecrystal@gmail.com,1
1,2,Darren Phelps,PAS,14293769,"34305 Vega Junction Jeremyburgh, AZ 32844",+502 3152 2884,daniel73@gmail.com,4
2,3,Lisa Walker,DNI,79275202,"38323 Poole Isle Apt. 496 Blackburnshire, SC 0...",+502 5440 6174,mahoneymatthew@leonard.net,4
3,4,Kathryn Brown,DNI,66854544,"08148 Robert Lodge Suite 112 Morenoton, MO 68236",+502 5262 3162,ahoffman@yahoo.com,3
4,5,Ryan Barton,PAS,96713205,"09778 Morgan Club Apt. 651 North Bryan, UT 89281",+502 4078 4623,kpeterson@thompson.com,1

In [14]:
dim_categoria = pd.read_sql('SELECT * FROM dim_categoria;', driver)
dim_categoria.head()

   categoria_id    nombre                    descripcion
0             1    Frutas         Frutas frescas y secas
1             2  Verduras  Verduras y hortalizas frescas
2             3    Carnes         Carnes rojas y blancas
3             4  Pescados            Pescados y mariscos
4             5   Lácteos        Leche, yogures y quesos

In [15]:
dim_tiempo = pd.read_sql('SELECT * FROM dim_tiempo;', driver)
dim_tiempo.head()

        fecha  dia  mes   año  trimestre dia_semana
0  2000-01-11   11    1  2000          1     Martes
1  2000-03-01    1    3  2000          1  Miércoles
2  2000-03-11   11    3  2000          1     Sábado
3  2000-03-15   15    3  2000          1  Miércoles
4  2000-03-20   20    3  2000          1      Lunes

In [16]:
fact_ventas = pd.read_sql('SELECT * FROM fact_ventas;', driver)
fact_ventas.head()

,fact_venta_id,fecha,cantidad,precio_unitario,descuento,impuesto,total,articulo_id,cliente_id,usuario_id,categoria_id
0,500,2016-07-10,3,77.87,0.0,12.0,233.61,41,50,3,4
1,501,2016-07-10,2,21.84,0.0,12.0,43.68,30,50,3,7
2,502,2016-07-10,1,30.03,0.0,12.0,30.03,312,50,3,2
3,503,2016-07-10,2,76.15,0.0,12.0,152.30,307,50,3,8
4,504,2016-07-10,2,61.40,0.0,12.0,122.80,326,50,3,4